open-vela/nuttx/arch/arm/src/bk7258/bk7258_psram.c
/****************************************************************************
 * arch/arm/src/bk7258/bk7258_psram.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* BK7258 PSRAM controller driver.
 *
 * Initializes the on-chip PSRAM controller and detects the external
 * PSRAM chip via the command-register interface.
 *
 * Source: Armino psram_driver.c + psram_hal.c + sys_psram_driver.c,
 * Beken, Apache-2.0
 *
 * NOTE: Cache coherency not addressed.  The BK7258 port currently
 * runs without CONFIG_ARMV8M_DCACHE; no cache maintenance is
 * performed here.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/arch.h>
#include <nuttx/mm/mm.h>
#include <syslog.h>

#include "arm_internal.h"
#include "hardware/bk7258_psram.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Analog register base and SPI state register.
 * Source: Armino sys_ll.h + bk7258_audio.c
 * All ana_reg* at 0x440101xx go through a serial SPI bus; every write
 * must poll the completion bit before the next write.
 */

#define SYS_BASE               0x44010000
#define ANA_BASE               (SYS_BASE + 0x100)
#define ANA_SPI_STATE_REG      (SYS_BASE + 0x3a * 4)

/* AHB power domain: pwd_ahbp = bit[5] of cpu_power_sleep_wakeup.
 * 0 = powered on, 1 = powered off.
 * Source: Armino sys_struct.h, sys_ll.h
 */

#define SYS_POWER_SLEEP_WAKEUP (SYS_BASE + 0x10 * 4)
#define PWD_AHBP_BIT           (1 << 5)

/* PSRAM peripheral clock enable: bit[19] of cpu_device_clk_enable.
 * Source: Armino sys_hal.c, sys_struct.h
 */

#define SYS_DEV_CLK_ENABLE     (SYS_BASE + 0x0c * 4)
#define PSRAM_CKEN_BIT         (1 << 19)

/* Command interface retry/poll limits.
 * Source: Armino psram_hal.c -> psram_hal_cmd_read()
 */

#define CMD_READ_RETRIES       5
#define CMD_READ_POLL_OUTER    10
#define CMD_READ_POLL_INNER    5000

/****************************************************************************
 * Private Data
 ****************************************************************************/

static uint32_t g_psram_chip_id;
static uint32_t g_psram_size;
static bool g_psram_init_done;

/* PSRAM heap — initialized on first use via bk7258_psram_heap_init().
 * Uses the NuttX mm allocator over the PSRAM data window.
 */

static struct mm_heap_s *g_psram_heap;

/****************************************************************************
 * Private Functions — Register Access
 ****************************************************************************/

/****************************************************************************
 * Name: psram_putreg / psram_getreg
 *
 * Description:
 *   Raw 32-bit register access helpers.
 *
 ****************************************************************************/

static inline void psram_putreg(uint32_t val, uint32_t addr)
{
  *(volatile uint32_t *)addr = val;
}

static inline uint32_t psram_getreg(uint32_t addr)
{
  return *(volatile uint32_t *)addr;
}

/****************************************************************************
 * Name: ana_write
 *
 * Description:
 *   Write to an analog register (0x440101xx) and poll the SPI bus
 *   completion bit.  The BK7258 analog registers are behind a serial
 *   SPI bridge; writes are NOT instantaneous and must be polled.
 *
 *   Source: Armino sys_ll.h -> sys_ll_set_analog_reg_value()
 *           + bk7258_audio.c -> ana_write()
 *
 *   WARNING: Every write to an address in 0x440101xx MUST go through
 *   this function.  A plain psram_putreg() will appear to succeed
 *   (the value is latched in the register) but the SPI transfer may
 *   not have completed, causing the analog front-end to never
 *   configure properly.
 *
 ****************************************************************************/

static void ana_write(uintptr_t addr, uint32_t val)
{
  uint32_t idx = (addr - ANA_BASE) >> 2;

  psram_putreg(val, addr);

  while (psram_getreg(ANA_SPI_STATE_REG) & (1u << idx))
    {
    }
}

/****************************************************************************
 * Name: ana_rmw
 *
 * Description:
 *   Read-modify-write a bit field in an analog register.
 *   Reads the current value, clears the mask at pos, sets the new
 *   value, and writes via ana_write() (with SPI polling).
 *
 ****************************************************************************/

static void ana_rmw(uintptr_t addr, int pos, uint32_t mask,
                    uint32_t val)
{
  uint32_t reg = psram_getreg(addr);

  reg &= ~(mask << pos);
  reg |= ((val & mask) << pos);
  ana_write(addr, reg);
}

/****************************************************************************
 * Private Functions — PSRAM Controller
 ****************************************************************************/

/****************************************************************************
 * Name: psram_set_sf_reset
 *
 * Description:
 *   Set or release the PSRAM serial-flash interface reset.
 *   Uses read-modify-write to preserve other REG2 bits.
 *
 *   Source: Armino psram_ll_macro_def.h ->
 *           psram_ll_set_sf_reset_value()
 *
 ****************************************************************************/

