open-vela/nuttx/arch/arm/src/bk7258/bk7258_psram.c
static void psram_set_sf_reset(uint32_t value)
{
  uint32_t reg = psram_getreg(PSRAM_LL_REG2);

  reg &= ~PSRAM_SF_RESET_BIT;
  reg |= (value & 1);
  psram_putreg(reg, PSRAM_LL_REG2);
}

/****************************************************************************
 * Name: psram_set_reg2_bypass
 *
 * Description:
 *   Set the PSRAM bypass bit (bit[1]) in REG2, preserving other bits.
 *
 *   Source: Armino psram_hal.c -> psram_hal_config_init()
 *
 ****************************************************************************/

static void psram_set_reg2_bypass(void)
{
  uint32_t val = psram_getreg(PSRAM_LL_REG2);

  val |= (0x1 << 1);
  psram_putreg(val, PSRAM_LL_REG2);
}

/****************************************************************************
 * Name: psram_cmd_reset
 *
 * Description:
 *   Issue a reset command to the PSRAM chip via the command interface.
 *
 *   Source: Armino psram_hal.c -> psram_hal_set_cmd_reset()
 ****************************************************************************/

static void psram_cmd_reset(void)
{
  psram_putreg(PSRAM_CMD_RESET, PSRAM_LL_REG8);
}

/****************************************************************************
 * Name: psram_cmd_write
 *
 * Description:
 *   Write a value to a PSRAM register address via the command
 *   interface.  Includes a generous timeout to avoid infinite hang.
 *
 *   Source: Armino psram_hal.c -> psram_hal_cmd_write()
 ****************************************************************************/

static int psram_cmd_write(uint32_t addr, uint32_t value)
{
  int timeout = CMD_READ_POLL_OUTER * CMD_READ_POLL_INNER;

  psram_putreg(addr, PSRAM_LL_REG9);
  psram_putreg(value, PSRAM_LL_REGA);
  psram_putreg(PSRAM_CMD_WRITE_TRIG, PSRAM_LL_REG8);

  while ((psram_getreg(PSRAM_LL_REG8) & PSRAM_CMD_WRITE_TRIG) &&
         --timeout > 0)
    {
    }

  if (timeout <= 0)
    {
      syslog(LOG_ERR, "psram: cmd_write timeout\n");
      return -ETIMEDOUT;
    }

  return OK;
}

/****************************************************************************
 * Name: psram_cmd_read
 *
 * Description:
 *   Read a value from a PSRAM chip register via the command interface.
 *   Retries up to CMD_READ_RETRIES times, with SF reset + cmd reset
 *   between retries.
 *
 *   Source: Armino psram_hal.c -> psram_hal_cmd_read()
 ****************************************************************************/

static uint32_t psram_cmd_read(uint32_t addr)
{
  int retry;
  int outer;
  int inner;

  for (retry = 0; retry < CMD_READ_RETRIES; retry++)
    {
      psram_putreg(addr, PSRAM_LL_REG9);
      psram_putreg(PSRAM_CMD_READ_TRIG, PSRAM_LL_REG8);

      for (outer = 0; outer < CMD_READ_POLL_OUTER; outer++)
        {
          for (inner = 0; inner < CMD_READ_POLL_INNER; inner++)
            {
              if (!(psram_getreg(PSRAM_LL_REG8) &
                    PSRAM_CMD_READ_TRIG))
                {
                  return psram_getreg(PSRAM_LL_REGB);
                }
            }
        }

      /* Timeout: reset SF interface and retry */

      psram_set_sf_reset(0);
      psram_set_sf_reset(1);
      psram_cmd_reset();
    }

  return 0;
}

/****************************************************************************
 * Name: psram_set_clk
 *
 * Description:
 *   Set PSRAM clock source and divider.
 *
 *   Source: Armino psram_hal.c -> psram_hal_set_clk()
 ****************************************************************************/

static void psram_set_clk(uint32_t sel, uint32_t div)
{
  uint32_t val = psram_getreg(SYS_CPU_CLK_DIV2);

  val &= ~(CLK_DIV2_CKSEL_PSRAM | CLK_DIV2_CKDIV_PSRAM);
  val |= (sel ? CLK_DIV2_CKSEL_PSRAM : 0) |
         (div ? CLK_DIV2_CKDIV_PSRAM : 0);
  psram_putreg(val, SYS_CPU_CLK_DIV2);
}

/****************************************************************************
 * Private Functions — Chip-Specific Init
 *
 * Each function configures the PSRAM controller for a specific chip
 * type, reads and verifies the chip ID, then configures the chip's
 * own mode registers (MR0/MR4/MR8) for proper latency, drive
 * strength, and burst settings.
 *
 * Source: Armino psram_hal.c -> psram_hal_APS6408L_init(),
 *         psram_hal_APS128XXO_OB9_init(),
 *         psram_hal_W955D8MKY_5J_init()
 ****************************************************************************/

/****************************************************************************
 * Name: psram_init_aps6408l
 *
 * Description:
 *   Init sequence for AP Memory APS6408L (8MB, ID 0x8D09).
 *   Configures MR0 (drive/latency) and MR4 (write latency).
 *
 ****************************************************************************/

static int psram_init_aps6408l(uint32_t *id)
{
  uint32_t val;

  psram_putreg(PSRAM_MODE_APS6408L, PSRAM_LL_REG4);
  psram_putreg(PSRAM_DRV_APS6408L, PSRAM_LL_REG5);
  psram_cmd_reset();
  up_udelay(500);

  val = psram_cmd_read(0x00000000);
  if (val == 0 || val != *id)
    {
      return -1;
    }

  *id = val;

  /* MR0: set drive strength and latency */

  val = psram_getreg(PSRAM_LL_REGB);
  val = (val & ~0x1f) | (0x4 << 2) | 0x3;
  psram_cmd_write(0x00000000, val);

  /* MR4: set write latency (6 @ 120 MHz) */

  psram_cmd_read(0x00000004);
  val = psram_getreg(PSRAM_LL_REGB);
  val = (val & ~(0x7 << 5)) | (0x6 << 5);
  psram_cmd_write(0x00000004, val);

  return 0;
}

/****************************************************************************
 * Name: psram_init_aps128xxo
 *
 * Description:
 *   Init sequence for AP Memory APS128XXO (16MB, ID 0x8D08).
 *   Configures MR0 (drive/latency), MR4 (write latency), and MR8
 *   (burst length).
 *
 ****************************************************************************/

static int psram_init_aps128xxo(uint32_t *id)
{
  uint32_t val;

  psram_putreg(PSRAM_MODE_APS128XXO, PSRAM_LL_REG4);
  psram_putreg(PSRAM_DRV_APS128XXO, PSRAM_LL_REG5);
  psram_cmd_reset();
  up_udelay(500);

  val = psram_cmd_read(0x00000000);
  if (val == 0 || val != *id)
    {
      return -1;
    }

  *id = val;

  /* MR0: set drive strength and latency */

  val = psram_getreg(PSRAM_LL_REGB);
  val = (val & ~0x1f) | (0x6 << 2) | 0x2;
  psram_cmd_write(0x00000000, val);

  /* MR4: set write latency (6 @ 120 MHz) */

