open-vela/nuttx/arch/arm/src/bk7258/bk7258_psram.c
  psram_cmd_read(0x00000004);
  val = psram_getreg(PSRAM_LL_REGB);
  val = (val & ~(0x7 << 5)) | (0x6 << 5);
  psram_cmd_write(0x00000004, val);

  /* MR8: set burst length bit */

  psram_cmd_read(0x00000008);
  val = psram_getreg(PSRAM_LL_REGB);
  val |= 0x40;
  psram_cmd_write(0x00000008, val);

  return 0;
}

/****************************************************************************
 * Name: psram_init_w955d8mky
 *
 * Description:
 *   Init sequence for Winbond W955D8MKY (4MB, ID 0x1C8F on BK7258).
 *   Configures drive strength via a command write to 0x01000000.
 *
 ****************************************************************************/

static int psram_init_w955d8mky(uint32_t *id)
{
  uint32_t val;
  uint32_t io_drv = 0;

  psram_putreg(PSRAM_MODE_W955D8MKY, PSRAM_LL_REG4);
  psram_putreg(PSRAM_DRV_W955D8MKY, PSRAM_LL_REG5);
  psram_cmd_reset();
  up_udelay(500);

  val = psram_cmd_read(0x01000000);
  if (val == 0)
    {
      return -1;
    }

  /* Configure drive strength */

  val = 0x1c8f | (io_drv << 4);
  psram_cmd_write(0x01000000, val);

  /* Verify */

  psram_cmd_read(0x01000000);

  *id = PSRAM_ID_W955D8MKY;
  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_psram_init
 *
 * Description:
 *   Initialize the BK7258 PSRAM controller and detect the external
 *   PSRAM chip.  Sets g_psram_chip_id and g_psram_size.
 *
 *   Sequence (source: Armino psram_hal_power_clk_enable +
 *   psram_hal_config_init):
 *     1. Set voltage: ana_reg13 psldo_swb=1, vpsramsel=3 (1.95V)
 *     2. Enable PSRAM LDO: ana_reg13 enpsram=1, wait 1ms
 *     3. Enable AHB PSRAM power domain: clear pwd_ahbp bit
 *     4. Set init clock to 80 MHz (320MHz PLL, div=1)
 *     5. Enable PSRAM peripheral clock (bit 19)
 *     6. Release SF reset + set bypass bit in REG2
 *     7. Auto-detect: try APS6408L -> APS128XXO -> W955D8MKY
 *        (each: set mode/drive, reset, read ID, configure MRs)
 *     8. Switch to 120 MHz default clock
 *
 *   NOTE: Cache coherency not addressed (no D-cache configured).
 *
 * Returned Value:
 *   OK on success (chip detected), -ENODEV if no known chip found.
 *
 ****************************************************************************/

int bk7258_psram_init(void)
{
  uint32_t val;
  uint32_t id;

  if (g_psram_init_done)
    {
      return OK;
    }

  g_psram_chip_id = 0;
  g_psram_size = 0;

  /* Step 1: Set PSRAM LDO voltage to 1.95V (psldo_swb=1, vpsramsel=3).
   * Source: Armino sys_hal_psram_psldo_vset()
   * Must use ana_write (read-modify-write + SPI poll), not plain MMIO.
   */

  ana_rmw(SYS_ANA_REG13, 28, 0x1, 1);   /* psldo_swb = 1 */
  ana_rmw(SYS_ANA_REG13, 29, 0x3, 3);   /* vpsramsel = 3 */

  /* Step 2: Enable PSRAM LDO.
   * Source: Armino sys_hal_psram_ldo_enable()
   */

  ana_rmw(SYS_ANA_REG13, 31, 0x1, 1);   /* enpsram = 1 */
  up_mdelay(1);

  /* Step 3: Enable AHB PSRAM power domain.
   * Source: Armino bk_pm_module_vote_power_ctrl(AHBP_PSRAM, ON)
   *         -> sys_hal_module_power_ctrl()
   * Clear pwd_ahbp (bit 5) to power on the AHB domain.
   */

  val = psram_getreg(SYS_POWER_SLEEP_WAKEUP);
  val &= ~PWD_AHBP_BIT;
  psram_putreg(val, SYS_POWER_SLEEP_WAKEUP);

  /* Step 4: Set init clock to 80 MHz (320 MHz PLL, divider=1).
   * Source: Armino psram_hal_set_clk(PSRAM_80M)
   */

  psram_set_clk(0, 1);   /* sel=0 (320MHz), div=1 */

  /* Step 5: Enable PSRAM peripheral clock (bit 19).
   * Source: Armino sys_drv_dev_clk_pwr_up(CLK_PWR_ID_PSRAM, PWR_UP)
   */

  val = psram_getreg(SYS_DEV_CLK_ENABLE);
  val |= PSRAM_CKEN_BIT;
  psram_putreg(val, SYS_DEV_CLK_ENABLE);

  /* Step 6: Release SF reset and set bypass bit.
   * Source: Armino psram_hal_config_init()
   */

  psram_set_sf_reset(1);
  psram_set_reg2_bypass();

  up_udelay(3000);

  /* Step 7: Auto-detect PSRAM chip type.
   * Try each type in sequence; first match wins.
   * Each init function sets mode/drive, resets, reads ID,
   * and configures the chip's mode registers.
   * Source: Armino psram_hal_config_init()
   */

  id = PSRAM_ID_APS6408L;
  if (psram_init_aps6408l(&id) == 0)
    {
      g_psram_chip_id = id;
      g_psram_size = 8 * 1024 * 1024;
    }
  else
    {
      id = PSRAM_ID_APS128XXO;
      if (psram_init_aps128xxo(&id) == 0)
        {
          g_psram_chip_id = id;
          g_psram_size = 16 * 1024 * 1024;
        }
      else
        {
          id = PSRAM_ID_W955D8MKY;
          if (psram_init_w955d8mky(&id) == 0)
            {
              g_psram_chip_id = id;
              g_psram_size = 4 * 1024 * 1024;
            }
          else
            {
              syslog(LOG_ERR,
                     "psram: no known chip detected\n");
              return -ENODEV;
            }
        }
    }

  /* Step 8: Switch to 120 MHz default clock.
   * Source: Armino psram_hal_set_default_clk()
   */

  up_mdelay(1);
  psram_set_clk(1, 1);   /* sel=1 (480MHz), div=1 -> 120MHz */

  g_psram_init_done = true;

  syslog(LOG_INFO,
         "psram: init OK, ID=0x%04lx, size=%lu KB\n",
         (unsigned long)g_psram_chip_id,
         (unsigned long)(g_psram_size / 1024));
  return OK;
}

/****************************************************************************
 * Name: bk7258_psram_deinit
 *
 * Description:
 *   Power off the PSRAM subsystem to save ~80-90mA standby current.
 *   Strict reverse of bk7258_psram_init():
 *     1. Disable PSRAM peripheral clock (bit19 of SYS_DEV_CLK_ENABLE)
 *     2. Disable PSRAM LDO (ana_reg13 enpsram=0, via SPI-polled ana_rmw)
 *     3. Power off AHB domain (set pwd_ahbp bit5 of SYS_POWER_SLEEP_WAKEUP)
 *     4. Clear g_psram_init_done so next init runs full sequence
 *
 *   Idempotent — no-op if not initialized.
 *
 ****************************************************************************/

void bk7258_psram_deinit(void)
{
  uint32_t val;

  if (!g_psram_init_done)
    {
      return;
    }

  /* 1. Disable PSRAM peripheral clock (bit19) */

  val = psram_getreg(SYS_DEV_CLK_ENABLE);
  val &= ~PSRAM_CKEN_BIT;
  psram_putreg(val, SYS_DEV_CLK_ENABLE);

  /* 2. Disable PSRAM LDO (ana_reg13 enpsram=0).
   * Must use ana_rmw (SPI-polled) — plain MMIO won't complete the
   * SPI transfer to the analog front-end.
   */

  ana_rmw(SYS_ANA_REG13, 31, 0x1, 0);   /* enpsram = 0 */

  /* 3. Power off AHB PSRAM domain (set pwd_ahbp bit5) */

  val = psram_getreg(SYS_POWER_SLEEP_WAKEUP);
  val |= PWD_AHBP_BIT;
  psram_putreg(val, SYS_POWER_SLEEP_WAKEUP);

  /* 4. Clear guard — next bk7258_psram_init() will run full sequence */

  g_psram_init_done = false;
  g_psram_chip_id = 0;
  g_psram_size = 0;

  syslog(LOG_INFO,
         "psram: deinit — clock off, LDO off, AHB off\n");
}

/****************************************************************************
 * Name: bk7258_psram_get_id
 *
 * Description:
 *   Return the detected PSRAM chip ID (0 if not initialized).
 *
 ****************************************************************************/

