open-vela/nuttx/arch/arm/src/bk7258/bk7258_psram.c
uint32_t bk7258_psram_get_id(void)
{
  return g_psram_chip_id;
}

/****************************************************************************
 * Name: bk7258_psram_get_size
 *
 * Description:
 *   Return the detected PSRAM size in bytes (0 if not initialized).
 *
 ****************************************************************************/

uint32_t bk7258_psram_get_size(void)
{
  return g_psram_size;
}

/****************************************************************************
 * Name: bk7258_psram_probe
 *
 * Description:
 *   Full S1 verification: init + ID check + single-word data path
 *   test on the memory-mapped window (0x60000000).
 *
 *   The ID check uses the command-register path (REG9/REG_A/REG_B).
 *   The data path test uses the AXI memory-mapped window.  These are
 *   two independent hardware paths; testing both in S1 ensures we
 *   don't mix up "controller works" with "data window works".
 *
 *   NOTE: Cache coherency not addressed (no D-cache configured).
 *
 * Returned Value:
 *   OK on success, negative errno on failure.
 *
 ****************************************************************************/

int bk7258_psram_probe(void)
{
  volatile uint32_t *psram_base;
  uint32_t save;
  uint32_t readback;
  int ret;

  /* Run full init sequence */

  ret = bk7258_psram_init();
  if (ret < 0)
    {
      return ret;
    }

  /* Single-word data path test on memory-mapped window */

  psram_base = (volatile uint32_t *)0x60000000;

  /* Save original content (avoid destructive test on first word) */

  save = *psram_base;

  /* Write test pattern */

  *psram_base = 0xdeadbeef;
  readback = *psram_base;

  /* Restore original content */

  *psram_base = save;

  if (readback != 0xdeadbeef)
    {
      syslog(LOG_ERR, "psram: data path FAIL "
             "(wrote 0xdeadbeef, read 0x%08lx)\n",
             (unsigned long)readback);
      return -EIO;
    }

  syslog(LOG_INFO, "psram: data path OK (0x60000000 verified)\n");
  return OK;
}

/****************************************************************************
 * Name: psram_check_no_heap
 *
 * Description:
 *   Guard for destructive tests.  If the PSRAM heap has been
 *   initialized its metadata lives at 0x60000000; any write to
 *   that region would corrupt it.  Returns -EBUSY if the heap
 *   is active.
 *
 ****************************************************************************/

static int psram_check_no_heap(FAR const char *who)
{
  if (g_psram_heap != NULL)
    {
      syslog(LOG_ERR,
             "psram %s: heap is active, "
             "reboot to run destructive tests\n",
             who);
      return -EBUSY;
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_psram_test
 *
 * Description:
 *   Address-in-address destructive test over the PSRAM window.
 *   Writes each 32-bit address's own address as the value, then
 *   reads back and verifies.  Reports errors, throughput, and
 *   boundary checks.
 *
 *   WARNING: This is a destructive test.  All data in the tested
 *   range will be overwritten.
 *
 * Input Parameters:
 *   size_bytes - Number of bytes to test (rounded down to 4-byte
 *                alignment).  If 0, uses g_psram_size.
 *
 * Returned Value:
 *   OK on success (zero errors), -EIO if any mismatch found.
 *
 ****************************************************************************/

int bk7258_psram_test(uint32_t size_bytes)
{
  volatile uint32_t *base = (volatile uint32_t *)0x60000000;
  volatile uint32_t *last;
  uint32_t errors = 0;
  uint32_t first_bad = 0;
  uint32_t first_exp = 0;
  uint32_t first_got = 0;
  uint32_t save_last;
  uint32_t i;
  uint32_t nwords;
  clock_t t_start;
  clock_t t_wr;
  clock_t t_rd;
  uint32_t wr_kbps_x10;
  uint32_t rd_kbps_x10;
  int ret;

  ret = psram_check_no_heap("test");
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_psram_init();
  if (ret < 0)
    {
      return ret;
    }

  if (size_bytes == 0)
    {
      size_bytes = g_psram_size;
    }

  if (size_bytes > g_psram_size)
    {
      size_bytes = g_psram_size;
    }

  nwords = size_bytes / 4;

  syslog(LOG_INFO,
         "psram test: range 0x%08lx - 0x%08lx (%lu KB, destructive)\n",
         (unsigned long)0x60000000,
         (unsigned long)(0x60000000 + size_bytes - 1),
         (unsigned long)(size_bytes / 1024));

  /* Write phase: each word gets its own byte address */

  t_start = clock_systime_ticks();

  for (i = 0; i < nwords; i++)
    {
      base[i] = (uint32_t)(0x60000000 + i * 4);

      /* Progress every 1 MB */

      if ((i & 0x3ffff) == 0 && i > 0)
        {
          syslog(LOG_INFO, "  wrote %lu MB\n",
                 (unsigned long)(i * 4 / (1024 * 1024)));
        }
    }

  t_wr = clock_systime_ticks() - t_start;

  /* Read-and-verify phase */

  t_start = clock_systime_ticks();

  for (i = 0; i < nwords; i++)
    {
      uint32_t expected = (uint32_t)(0x60000000 + i * 4);
      uint32_t actual = base[i];

      if (actual != expected)
        {
          if (errors == 0)
            {
              first_bad = 0x60000000 + i * 4;
              first_exp = expected;
              first_got = actual;
            }

          errors++;

          /* Print first few errors in detail */

          if (errors <= 5)
            {
              syslog(LOG_ERR,
                     "  MISMATCH @ 0x%08lx: "
                     "expected 0x%08lx, got 0x%08lx\n",
                     (unsigned long)(0x60000000 + i * 4),
                     (unsigned long)expected,
                     (unsigned long)actual);
            }
        }

      /* Progress every 1 MB */

      if ((i & 0x3ffff) == 0 && i > 0)
        {
          syslog(LOG_INFO, "  verified %lu MB\n",
                 (unsigned long)(i * 4 / (1024 * 1024)));
        }
    }

  t_rd = clock_systime_ticks() - t_start;

  /* KB/s with 1 decimal (integer math: value * 10 / 1024).
   * size_bytes * 1000 stays < 2^32 for sizes up to 4 MB per
   * phase; for larger sizes the intermediate is still safe
   * up to ~16 MB (16M * 1000 = 16G < 2^34, fits uint64_t).
   */

  if (t_wr > 0)
    {
      wr_kbps_x10 = (uint32_t)((uint64_t)size_bytes * 1000
                     / (uint64_t)t_wr / 1024);
    }
  else
    {
      wr_kbps_x10 = 0;
    }

  if (t_rd > 0)
    {
      rd_kbps_x10 = (uint32_t)((uint64_t)size_bytes * 1000
                     / (uint64_t)t_rd / 1024);
    }
  else
    {
      rd_kbps_x10 = 0;
    }

  /* Boundary check: last word */

  last = (volatile uint32_t *)(0x60000000 + g_psram_size - 4);
  save_last = *last;
  *last = 0xcafebabe;

  if (*last != 0xcafebabe)
    {
      syslog(LOG_ERR, "  BOUNDARY FAIL @ 0x%08lx: "
             "wrote 0xcafebabe, read 0x%08lx\n",
             (unsigned long)(0x60000000 + g_psram_size - 4),
             (unsigned long)*last);
      errors++;
    }

  *last = save_last;

  syslog(LOG_INFO,
         "psram test: %lu words, %lu errors, "
         "%lu.%lu / %lu.%lu KB/s (wr/rd), "
         "%lu.%02lu s total\n",
         (unsigned long)nwords,
         (unsigned long)errors,
         (unsigned long)(wr_kbps_x10 / 10),
         (unsigned long)(wr_kbps_x10 % 10),
         (unsigned long)(rd_kbps_x10 / 10),
         (unsigned long)(rd_kbps_x10 % 10),
         (unsigned long)((t_wr + t_rd) / TICK_PER_SEC),
         (unsigned long)((t_wr + t_rd) % TICK_PER_SEC *
                         100 / TICK_PER_SEC));

