open-vela/nuttx/arch/arm/src/bk7258/bk7258_psram.c
  if (errors > 0)
    {
      syslog(LOG_ERR,
             "psram test: first error @ 0x%08lx "
             "(expected 0x%08lx, got 0x%08lx)\n",
             (unsigned long)first_bad,
             (unsigned long)first_exp,
             (unsigned long)first_got);
      return -EIO;
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_psram_alias
 *
 * Description:
 *   Address alias detection.  Writes distinct patterns at offsets
 *   0, 4MB, 8MB, and 16MB-4KB, then re-reads offset 0 to check
 *   for aliasing (address wraparound).
 *
 *   Independent of chip ID — verifies actual usable capacity.
 *
 * Returned Value:
 *   OK if no aliasing detected, -EIO if aliasing found.
 *
 ****************************************************************************/

int bk7258_psram_alias(void)
{
  volatile uint32_t *base = (volatile uint32_t *)0x60000000;
  uint32_t save0;
  uint32_t readback;
  int ret;
  int aliased = 0;

  ret = psram_check_no_heap("alias");
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_psram_init();
  if (ret < 0)
    {
      return ret;
    }

  save0 = base[0];

  /* Write unique patterns at key offsets */

  base[0] = 0xaaaaaaaa;

  /* 4 MB offset */

  base[0x400000 / 4] = 0x11111111;
  syslog(LOG_INFO,
         "  wrote 0x11111111 @ 0x%08lx (4 MB)\n",
         (unsigned long)(0x60000000 + 0x400000));

  /* 8 MB offset */

  base[0x800000 / 4] = 0x22222222;
  syslog(LOG_INFO,
         "  wrote 0x22222222 @ 0x%08lx (8 MB)\n",
         (unsigned long)(0x60000000 + 0x800000));

  /* 16 MB - 4 KB offset (only meaningful if >= 16MB) */

  if (g_psram_size >= 16 * 1024 * 1024)
    {
      base[(16 * 1024 * 1024 - 4096) / 4] = 0x33333333;
      syslog(LOG_INFO,
             "  wrote 0x33333333 @ 0x%08lx (16MB-4K)\n",
             (unsigned long)(0x60000000 + 16 * 1024 * 1024 - 4096));
    }

  /* Re-read offset 0 — if it changed, aliasing occurred */

  readback = base[0];

  if (readback != 0xaaaaaaaa)
    {
      syslog(LOG_ERR,
             "psram alias: FAIL — offset 0 changed from "
             "0xaaaaaaaa to 0x%08lx (aliasing!)\n",
             (unsigned long)readback);
      aliased = 1;
    }

  /* Now check if writing at 8MB clobbers offset 0
   * (would indicate 8MB wraparound)
   */

  base[0] = 0xbbbbbbbb;
  readback = base[0x800000 / 4];

  if (readback == 0xbbbbbbbb)
    {
      syslog(LOG_ERR,
             "psram alias: 8 MB offset mirrors offset 0 "
             "(real capacity <= 8 MB)\n");
      aliased = 1;
    }

  /* Restore */

  base[0] = save0;

  if (!aliased)
    {
      syslog(LOG_INFO,
             "psram alias: OK — no aliasing detected "
             "(%lu MB usable)\n",
             (unsigned long)(g_psram_size / (1024 * 1024)));
    }

  return aliased ? -EIO : OK;
}

/****************************************************************************
 * Name: bk7258_psram_width
 *
 * Description:
 *   Access width test: verifies 8-bit, 16-bit, and 32-bit
 *   read/write to the PSRAM window.  Some controllers only
 *   support word access; this test catches that early.
 *
 *   Uses the first 16 bytes of PSRAM (non-destructive to the
 *   rest).
 *
 * Returned Value:
 *   OK if all widths pass, -EIO if any width fails.
 *
 ****************************************************************************/

int bk7258_psram_width(void)
{
  volatile uint8_t  *base8  = (volatile uint8_t  *)0x60000000;
  volatile uint16_t *base16 = (volatile uint16_t *)0x60000000;
  volatile uint32_t *base32 = (volatile uint32_t *)0x60000000;
  uint32_t save[4];
  int failures = 0;
  int ret;

  ret = psram_check_no_heap("width");
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_psram_init();
  if (ret < 0)
    {
      return ret;
    }

  /* Save first 16 bytes */

  save[0] = base32[0];
  save[1] = base32[1];
  save[2] = base32[2];
  save[3] = base32[3];

  /* Test 32-bit access */

  base32[0] = 0xdeadbeef;
  base32[1] = 0xcafebabe;
  if (base32[0] != 0xdeadbeef || base32[1] != 0xcafebabe)
    {
      syslog(LOG_ERR, "  32-bit: FAIL (wrote dead/cafe, "
             "read 0x%08x/0x%08x)\n",
             (unsigned)base32[0], (unsigned)base32[1]);
      failures++;
    }
  else
    {
      syslog(LOG_INFO, "  32-bit: OK\n");
    }

  /* Test 16-bit access (critical for RGB565 framebuffer) */

  base16[0] = 0x1234;
  base16[1] = 0x5678;
  base16[2] = 0x9abc;
  base16[3] = 0xdef0;
  if (base16[0] != 0x1234 || base16[1] != 0x5678 ||
      base16[2] != 0x9abc || base16[3] != 0xdef0)
    {
      syslog(LOG_ERR, "  16-bit: FAIL (read 0x%04x/0x%04x/"
             "0x%04x/0x%04x)\n",
             (unsigned)base16[0], (unsigned)base16[1],
             (unsigned)base16[2], (unsigned)base16[3]);
      failures++;
    }
  else
    {
      syslog(LOG_INFO, "  16-bit: OK (RGB565 framebuffer safe)\n");
    }

  /* Test 8-bit access */

  base8[0] = 0xaa;
  base8[1] = 0x55;
  base8[2] = 0xff;
  base8[3] = 0x00;
  if (base8[0] != 0xaa || base8[1] != 0x55 ||
      base8[2] != 0xff || base8[3] != 0x00)
    {
      syslog(LOG_ERR, "  8-bit:  FAIL (read 0x%02x/0x%02x/"
             "0x%02x/0x%02x)\n",
             (unsigned)base8[0], (unsigned)base8[1],
             (unsigned)base8[2], (unsigned)base8[3]);
      failures++;
    }
  else
    {
      syslog(LOG_INFO, "  8-bit:  OK\n");
    }

  /* Restore */

  base32[0] = save[0];
  base32[1] = save[1];
  base32[2] = save[2];
  base32[3] = save[3];

  if (failures > 0)
    {
      syslog(LOG_ERR,
             "psram width: %d width(s) FAILED\n", failures);
      return -EIO;
    }

  syslog(LOG_INFO,
         "psram width: all widths OK (8/16/32-bit)\n");
  return OK;
}

/****************************************************************************
 * Name: bk7258_psram_heap_init
 *
 * Description:
 *   Initialize a standalone heap over the PSRAM data window
 *   (0x60000000, g_psram_size bytes).  Uses NuttX mm_initialize()
 *   to create a private heap that does NOT merge with the main
 *   SRAM heap.
 *
 *   Idempotent: calling when g_psram_heap != NULL is a no-op.
 *   Internally ensures the PSRAM controller is initialized.
 *
 * Returned Value:
 *   OK on success, negative errno on failure.
 *
 ****************************************************************************/

