open-vela/nuttx/arch/arm/src/bk7258/bk7258_psram.c
int bk7258_psram_heap_init(void)
{
  int ret;

  if (g_psram_heap != NULL)
    {
      return OK;
    }

  ret = bk7258_psram_init();
  if (ret < 0)
    {
      return ret;
    }

  g_psram_heap = mm_initialize("psram",
                                (FAR void *)0x60000000,
                                g_psram_size);
  if (g_psram_heap == NULL)
    {
      syslog(LOG_ERR, "psram heap: mm_initialize failed\n");
      return -ENOMEM;
    }

  syslog(LOG_INFO,
         "psram heap: ready, base=0x60000000, size=%lu KB\n",
         (unsigned long)(g_psram_size / 1024));
  return OK;
}

/****************************************************************************
 * Name: bk7258_psram_malloc
 *
 * Description:
 *   Allocate `size` bytes from the PSRAM heap.
 *   Returns NULL if the heap is not initialized or allocation fails.
 *   The returned pointer is guaranteed to be in 0x60xxxxxx.
 *
 ****************************************************************************/

FAR void *bk7258_psram_malloc(size_t size)
{
  if (g_psram_heap == NULL)
    {
      return NULL;
    }

  return mm_malloc(g_psram_heap, size);
}

/****************************************************************************
 * Name: bk7258_psram_calloc
 *
 * Description:
 *   Allocate zero-initialized array from the PSRAM heap.
 *
 ****************************************************************************/

FAR void *bk7258_psram_calloc(size_t n, size_t size)
{
  if (g_psram_heap == NULL)
    {
      return NULL;
    }

  return mm_calloc(g_psram_heap, n, size);
}

/****************************************************************************
 * Name: bk7258_psram_free
 *
 * Description:
 *   Free memory previously allocated from the PSRAM heap.
 *
 ****************************************************************************/

void bk7258_psram_free(FAR void *ptr)
{
  if (g_psram_heap != NULL && ptr != NULL)
    {
      mm_free(g_psram_heap, ptr);
    }
}

/****************************************************************************
 * Name: bk7258_psram_meminfo
 *
 * Description:
 *   Fill `info` with PSRAM heap statistics.  Equivalent to
 *   mallinfo() but for the PSRAM heap only.
 *
 ****************************************************************************/

void bk7258_psram_meminfo(FAR struct mallinfo *info)
{
  if (info == NULL)
    {
      return;
    }

  if (g_psram_heap == NULL)
    {
      memset(info, 0, sizeof(*info));
      return;
    }

  *info = mm_mallinfo(g_psram_heap);
}

/****************************************************************************
 * Name: bk7258_psram_memalign
 *
 * Description:
 *   Allocate `size` bytes from the PSRAM heap with `alignment`
 *   byte alignment.  Required for DMA targets (DVP, SPI) that
 *   need 32/64-byte aligned buffers.
 *
 *   D-cache note (2026-08): the current defconfig does NOT enable
 *   CONFIG_ARMV8M_DCACHE, so no cache maintenance is needed.
 *   If D-cache is enabled in the future, every buffer written by
 *   DMA must be cache-invalidated before the CPU reads it
 *   (arm_dcache_invalidate / up_invalidate_dcache).
 *   Without this the CPU will read stale cache lines instead of
 *   the DMA data — a data-corruption bug that is very hard to
 *   diagnose after the fact.
 *
 ****************************************************************************/

FAR void *bk7258_psram_memalign(size_t alignment, size_t size)
{
  if (g_psram_heap == NULL)
    {
      return NULL;
    }

  /* Reject alignment == 0 and non-power-of-two alignment.
   *
   * mm_memalign() only rejects non-powers of two: its check
   * ((alignment & -alignment) != alignment) lets 0 through, and the
   * subsequent DEBUGASSERT(((uintptr_t)ptr) % alignment == 0) then
   * divides by zero.  Filter it here so a bad caller gets NULL
   * instead of an assertion or an undefined-behaviour trap.
   */

  if (alignment == 0 || (alignment & (alignment - 1)) != 0)
    {
      syslog(LOG_ERR,
             "psram heap: invalid alignment %zu "
             "(must be a non-zero power of two)\n",
             alignment);
      return NULL;
    }

  return mm_memalign(g_psram_heap, alignment, size);
}
